def barcode(text):

    #해당 코드는 CODE128 바코드 중 CODE B에만 적용됩니다. (폰트는 Code 128 기준 제작) -230208 LYS
    #참고자료 : https://blog.naver.com/hanmindbend/221559633329

    list = [char for char in text] #문자열 한 글자씩 분리하여 리스트에 저장

    fontdic = {' ': 0, '!' : 1, '"' : 2, '#' : 3, '$' : 4, '%' : 5, '&' : 6, "'" : 7, '(' : 8, ')' : 9, '*' : 10,
               '+' : 11, ',' : 12, '-' : 13, '.' : 14, '/' : 15, '0' : 16, '1' : 17, '2' : 18, '3' : 19, '4' : 20,
               '5' : 21, '6' : 22, '7' : 23, '8' : 24, '9' : 25, ':' : 26, ';' : 27, '<' : 28, '=' : 29, '>' : 30, 
               '?' : 31, '@' : 32, 'A' : 33, 'B' : 34, 'C' : 35, 'D' : 36, 'E' : 37, 'F' : 38, 'G' : 39, 'H' : 40, 
               'I' : 41, 'J' : 42, 'K' : 43, 'L' : 44, 'M' : 45, 'N' : 46, 'O' : 47, 'P' : 48, 'Q' : 49, 'R' : 50, 
               'S' : 51, 'T' : 52, 'U' : 53, 'V' : 54, 'W' : 55, 'X' : 56, 'Y' : 57, 'Z' : 58, '[' : 59, '\\' : 60, 
               ']' : 61, '^' : 62, '_' : 63, '`' : 64, 'a' : 65, 'b' : 66, 'c' : 67, 'd' : 68, 'e' : 69, 'f' : 70, 
               'g' : 71, 'h' : 72, 'i' : 73, 'j' : 74, 'k' : 75, 'l' : 76, 'm' : 77, 'n' : 78, 'o' : 79, 'p' : 80, 
               'q' : 81, 'r' : 82, 's' : 83, 't' : 84, 'u' : 85, 'v' : 86, 'w' : 87, 'x' : 88, 'y' : 89, 'z' : 90, 
               '{' : 91, '|' : 92, '}' : 93, '~' : 94 } #딕셔너리를 이용해 문자를 숫자로 변경

    valuedic = {0 : 'Ï', 1 : '!', 2 : '"', 3 : '#', 4 : '$', 5 : '%', 6 : '&', 7 : "'", 8 : '(', 9 : ')', 10 : '*',
                11 : '+', 12 : ',', 13 : '-', 14 : '.', 15 : '/', 16 : '0', 17 : '1', 18 : '2', 19 : '3', 20 : '4',
                21 : '5', 22 : '6', 23 : '7', 24 : '8', 25 : '9', 26 : ':', 27 : ';', 28 : '<', 29 : '=', 30 : '>',
                31 : '?', 32 : '@', 33 : 'A', 34 : 'B', 35 : 'C', 36 : 'D', 37 : 'E', 38 : 'F', 39 : 'G', 40 : 'H',
                41 : 'I', 42 : 'J', 43 : 'K', 44 : 'L', 45 : 'M', 46 : 'N', 47 : 'O', 48 : 'P', 49 : 'Q', 50 : 'R',
                51 : 'S', 52 : 'T', 53 : 'U', 54 : 'V', 55 : 'W', 56 : 'X', 57 : 'Y', 58 : 'Z', 59 : '[', 60 : '\\',
                61 : ']', 62 : '^', 63 : '_', 64 : "`", 65 : 'a', 66 : 'b', 67 : 'c', 68 : 'd', 69 : 'e', 70 : 'f',
                71 : 'g', 72 : 'h', 73 : 'i', 74 : 'j', 75 : 'k', 76 : 'l', 77 : 'm', 78 : 'n', 79 : 'o', 80 : 'p',
                81 : 'q', 82 : 'r', 83 : 's', 84 : 't', 85 : 'u', 86 : 'v', 87 : 'w', 88 : 'x', 89 : 'y', 90 : 'z',
                91 : '{', 92 : '|', 93 : '}', 94 : '~', 95 : 'Ã', 96 : 'Ä', 97 : 'Å', 98 : 'Æ', 99 : 'Ç', 100 : 'È',
                101 : 'É', 102 : 'Ê'} # 딕셔너리를 이용해 숫자를 문자로 변경 (나머지 구할 때 사용)


    startcode = "Ì" # 바코드 시작코드 (CODE B 기준)
    stopcode = "Î"  # 바코드 종료코드 (CODE B 기준)

    total=1
    valuenums=0
    for e in list :

        font=fontdic[e]
        value=font*total
        total+=1            #fontdic 이용 문자를 숫자로 변경
        valuenums+=value    #숫자로 변경한 문자 전체 더함

    checksumvalue=(104+valuenums)%103   #(104->시작코드 숫자+전체 더한 숫자)/103 계산../103은 왜 나누는건지 이유몰라영...
    checksum=valuedic[checksumvalue]    #위에 계산한 숫자로 valuedic를 이용 checksumcharacter 구함


    barcode = startcode+text+checksum+stopcode   #결과값 출력

    return barcode